{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Задание 5*\n",
    "Имеется текстовый файл с набором русских слов(имена существительные, им.падеж)\n",
    "Одна строка файла содержит одно слово.\n",
    "Написать программу которая выводит список слов, каждый элемент списка которого - это новое слово,\n",
    "которое состоит из двух сцепленных в одно, которые имеются в текстовом файле.\n",
    "Порядок вывода слов НЕ имеет значения\n",
    "Например, текстовый файл содержит слова: ласты, стык, стыковка, баласт, кабала, карась\n",
    "Пользователь вводмт первое слово: ласты\n",
    "Программа выводит:\n",
    "ластык\n",
    "ластыковка\n",
    "Пользователь вводмт первое слово: кабала\n",
    "Программа выводит:\n",
    "кабаласты\n",
    "кабаласт\n",
    "Пользователь вводмт первое слово: стыковка\n",
    "Программа выводит:\n",
    "стыковкабала\n",
    "стыковкарась"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "кабаласты\n",
      "кабаласт\n"
     ]
    }
   ],
   "source": [
    "inp_word = input()\n",
    "words_lst = []\n",
    "\n",
    "with open('words.txt', 'r', encoding='utf-8') as file:\n",
    "    for line in file: # итерируемся по словам в файле\n",
    "        word = line.rstrip()\n",
    "        step = 1 # создаем шаг для двухстороннего слайсинга\n",
    "        if word == inp_word: # если слово пользователя и слово из файла равны - скипаем\n",
    "            continue\n",
    "        while step < len(word): # суть алгоритма в поиске одинаковых символов у слов для сцепки\n",
    "            inp_word_slice = inp_word[-step:] # у введенного слова отрезаем с последнего символа  \n",
    "            word_slice = word[:step] # у итерируемого слова из файла отрезаем с первого символа\n",
    "            match inp_word_slice == word_slice: # сравниваем отрезанные символы\n",
    "                case True: # если символы одинаковые то печатаем наше слово и добавляем к нему отрезок оставшихся символов из файла\n",
    "                    print(f\"{inp_word}{word[step:]}\")\n",
    "                    words_lst.append(f\"{inp_word}{word[step:]}\")\n",
    "                    break # выходим из внутреннего цикла while и переходим к следующему слову\n",
    "                case False: # прибавляем шаг если символы не равны\n",
    "                    step += 1 \n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
